AcDbObject.removePersistentReactor(AcDbObjectId)
Removes the persistent reactor from the currently open object
Returns:  Returns Acad::eOk if the reactor is removed successfully.
Returns eNullObjectId if id argument is null.
Returns eInvalidInput if id argument does not have valid format.
Returns eWasNotifying if object is open for notify but not for write.
Returns eKeyNotFound if reactor id is not attached to this object.
Remarks:  Current object must be open for write.

AcDbObject.addPersistentReactor(AcDbObjectId)
Adds a persistent reactor to the currently open object
Returns:  Returns Acad::eOk if the reactor is added successfully.
Returns eNullObjectId if id argument is null.
Returns eInvalidInput if id argument does not have valid format.
Returns eWrongDatabase if id argument is not in same database as object.
Returns eSelfReference if id argument is same as this object's.
Returns eDuplicateKey if reactor is already attached to this object.
Remarks:  Current object must be open for write.

AcDbObject.removeReactor(AcDbObjectReactor*)
Removes the non-persistent reactor from the currently open object
Returns:  Returns Acad::eOk if the reactor is removed successfully.
Returns eNullObjectPointer if incoming argument is null.
Returns eInvalidInput if incoming argument is not a valid pointer.
Returns eKeyNotFound if reactor is not attached to this object.
Remarks:  Current object may be open for notify, read or write.

AcDbObject.addReactor(AcDbObjectReactor*)
Adds a non-persistent reactor to the currently open object
Returns:  Returns Acad::eOk if the reactor is added successfully.
Returns eNullObjectPointer if incoming argument is null.
Returns eInvalidInput if incoming argument is not a valid pointer.
Returns eDuplicateKey if reactor is already attached to this object.
Remarks:  Current object may be open for notify, read or write.

AcDbObject.getBinaryData(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function reads a chunk of binary data from this object's extension
dictionary. It assumes that the data has been stored as a resbuf chain of 127-byte
pieces, which it concatenates into the larger data buffer that is returned. If the
data has been stored in any other type of resbuf, this function returns eBadDxfCode.
A null pointer should be passed to the data parameter. If this function succeeds,
it allocates the appropriate memory to contain the requested data, copies the data
into the memory, sets data to point to that memory, and returns the size of the data
in size.
The caller is responsible for freeing the allocated data buffer. The caller also is
responsible for opening the object for read.
key: Input extension dictionary key under which the data is stored
size: Output size of the returned data in bytes
data: Output requested data in an allocated buffer
Returns: Returns Acad::eOk if successful. Returns Acad::eBadDxfCode if data is stored
in resbufs that are not binary data chunks

AcDbObject.setBinaryData(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
This function copies the binary chunk pointed to by data into
this object's extension dictionary. It looks for key in the dictionary,
and either creates or overwrites a resbuf chain on an xrecord at that key.
The binary data is broken into 127-byte chunks for storage in the resbuf chain.
The caller is responsible for opening the object for write.
key: Input extension dictionary key to be used
size: Input size of the binary data, in bytes
data: Input pointer to a flat data buffer whose size, in bytes
is at least as large as size
Returns: Returns Acad::eOk if successful.

AcDbObject.dxfOut(AcDbDxfFiler*,System.Boolean,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*)
This function does some internal bookkeeping, calls the object's AcDbObject::dxfOutFields()
function, and then uses bAllXdata and pRegAppIds to determine what, if any xdata should be
written out. If bAllXdata == true, then all xdata is written out. If bAllXdata == false and
pRegAppIds == nullptr or points to an empty array, then no xdata is written out.  If
bAllXdata == false and pRegAppIds points to a non-empty array, then the xdata (if any) for
those regapp objectIds is written out.
pFiler: Input pointer to DXF filer to be used for this filing operation
bAllXdata: Input bool to specify whether or not all xdata should be written out
pRegAppIds: Input pointer to array of regapp objectIds
Returns: Returns the filer's status, which is Acad::eOk if successful.

AcDbObject.setIntendedDatabase(AcDbDatabase*)
This method allows setting an intended AcDbDatabase for this AcDbObject as
long as this AcDbObject is not yet in an AcDbDatabase.
When this AcDbObject is added to an AcDbDatabase, the intendedDatabase
will automatically become nullptr and this method will not allow setting
to anything else.
The intended AcDbDatabase is the AcDbDatabase that this object is expected
to be added to or associated with (such as if this AcDbObject is embedded
in another AcDbObject that is in an AcDbDatabase).
For AcDbEntities not yet in an AcDbDatabase, the intended AcDbDatabase is
automatically set when their layer, linetype, or material is set.
Custom object implementations should set the intended database whenever
any custom database specific property (i.e. associated with an AcDbObjectId)
on their object is set.
pDb: Input pointer to desired intended AcDbDatabase.
Returns: Returns Acad::eOk if successful or Acad::eInvalidContext if this AcDbObject
is already in an AcDbDatabase and pDb != nullptr.

AcDbObject.intendedDatabase
If this AcDbObject is not yet in an AcDbDatabase, and it has had its
intended AcDbDatabase set, then this method will return a pointer to that
intended AcDbDatabase.  The intended AcDbDatabase may be set when a database
specific property (such as the layer or linetype on entities) is set on this
AcDbObject, or if this AcDbObject's setIntendedDatabase() method has been called
to explicitly set the intended AcDbDatabase.
After this AcDbObject is added to an AcDbDatabase, this method will always return
nullptr.

AcDbObject.databaseToUse
This method returns a pointer to a AcDbDatabase object that can be
used with this AcDbObject.  If the AcDbObject is in an AcDbDatabase,
then a pointer to the AcDbDatabase returned by the object's database()
method will be returned, otherwise, if the AcDbObject has a non-nullptr
intendedDatabase, then a pointer to that AcDbDatabase will be returned,
workingDatabase will be returned.

AcDbObject.database
This method returns a pointer to the AcDbDatabase object that contains
the AcDbObject.